---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCAggregate.Dispose
source: html/d193643b-7929-3056-b0a1-fae64adb53d9.htm
---
# Autodesk.Revit.DB.IFC.IFCAggregate.Dispose Method

Releases all resources used by the IFCAggregate

## Syntax (C#)
```csharp
public void Dispose()
```